app/views/collections/show.html.erb


<% @collection.products.each do |product| %>
---
SELECT `products`.* FROM `products` INNER JOIN `collections_products` ON `products`.`id` = `collections_products`.`product_id` WHERE `collections_products`.`collection_id` = 1  ORDER BY name ASC, products.name