app/controllers/admin/collections_controller.rb

  def index
    @collections = Collection.all.paginate(page: params[:page], per_page: 30)
---
SELECT  `collections`.* FROM `collections`   ORDER BY name ASC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `collections`

  def create
    @collection = Collection.new(collection_params)
    if @collection.save
---
INSERT INTO `collections` (`created_at`, `long_description`, `name`, `short_description`, `updated_at`) VALUES ('2014-07-09 21:39:07', 'LongDesc', 'Lorem', 'Ipsum', '2014-07-09 21:39:07')

  def edit
    @collection = Collection.find(params[:id])
    @search = Product.search(params[:q])
---
SELECT  `collections`.* FROM `collections`  WHERE `collections`.`id` = 1  ORDER BY name ASC LIMIT 1
SELECT `products`.* FROM `products`   ORDER BY name ASC

  def update
    @collection = Collection.find(params[:id])
    if @collection.update_attributes(collection_params)
---
SELECT  `collections`.* FROM `collections`  WHERE `collections`.`id` = 4  ORDER BY name ASC LIMIT 1
UPDATE `collections` SET `active` = 1, `long_description` = 'newLongDesc', `name` = 'newName', `short_description` = 'newShortDesc', `updated_at` = '2014-07-09 21:39:08' WHERE `collections`.`id` = 4

  def search_products
    @collection = Collection.find(params[:id])
    @products = Product.where("name LIKE ?", "%#{params[:search_term]}%")
---
SELECT  `collections`.* FROM `collections`  WHERE `collections`.`id` = 1  ORDER BY name ASC LIMIT 1
SELECT `products`.* FROM `products`  WHERE (name LIKE '%Lorem6%')  ORDER BY name ASC

  def reset_search
    @collection = Collection.find(params[:id])
---
SELECT  `collections`.* FROM `collections`  WHERE `collections`.`id` = 1  ORDER BY name ASC LIMIT 1

  def destroy
    @collection = Collection.find(params[:id])
    @collection.destroy
---
SELECT  `collections`.* FROM `collections`  WHERE `collections`.`id` = 6  ORDER BY name ASC LIMIT 1
DELETE FROM `collections` WHERE `collections`.`id` = 6