app/controllers/admin/collections_controller.rb

  def index
    @collections = Collection.all.paginate(page: params[:page], per_page: 30)
---
SELECT  "collections".* FROM "collections"   ORDER BY name ASC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "collections"