app/controllers/admin/coupons_controller.rb

  def index
    @coupons = Coupon.all.paginate(page: params[:page], per_page: 30)
---
SELECT  `coupons`.* FROM `coupons`  LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `coupons`

  def create
    reformat_date_order!
    @coupon = Coupon.new(coupon_params)
    if @coupon.save
---
INSERT INTO `coupons` (`code`, `created_at`, `end_date`, `minimum_purchase_amount_cents`, `name`, `site_wide`, `start_date`, `type`, `updated_at`, `value`) VALUES ('ABC123', '2014-07-09 21:39:37', '2014-07-10 00:00:00', 500, 'Spring Sale', 1, '2014-07-09 00:00:00', 'FreeShippingCoupon', '2014-07-09 21:39:37', 0.0)

  def edit
    @coupon = Coupon.find(params[:id])
---
SELECT  `coupons`.* FROM `coupons`  WHERE `coupons`.`id` = 4 LIMIT 1

  def update
    reformat_date_order!
    @coupon = Coupon.find(params[:id])
    if @coupon.update_attributes(coupon_params)
---
SELECT  `coupons`.* FROM `coupons`  WHERE `coupons`.`id` = 3 LIMIT 1
UPDATE `coupons` SET `minimum_purchase_amount_cents` = 1500, `name` = 'Summer Sale', `site_wide` = 1, `start_date` = '2014-07-09 00:00:00', `type` = 'PercentageCoupon', `updated_at` = '2014-07-09 21:39:47', `value` = 10.0 WHERE `coupons`.`type` IN ('FlatCoupon') AND `coupons`.`id` = 3

  def destroy
    @coupon = Coupon.find(params[:id])
    @coupon.destroy
---
SELECT  `coupons`.* FROM `coupons`  WHERE `coupons`.`id` = 1 LIMIT 1
DELETE FROM `coupons` WHERE `coupons`.`type` IN ('FlatCoupon') AND `coupons`.`id` = 1