app/controllers/admin/coupons_controller.rb

  def index
    @coupons = Coupon.all.paginate(page: params[:page], per_page: 30)
---
SELECT  "coupons".* FROM "coupons"  LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "coupons"