app/controllers/admin/materials_controller.rb

INSERT INTO `materials` (`created_at`, `name`, `updated_at`) VALUES ('2014-07-09 21:40:43', 'materialName', '2014-07-09 21:40:43')
SELECT  `materials`.* FROM `materials`  WHERE `materials`.`name` = 'materialName'  ORDER BY `materials`.`id` ASC LIMIT 1
---
  def create
    @material = Material.where(name: material_params[:name]).first_or_create

SELECT  `materials`.* FROM `materials`  LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `materials`
---
  def index
    @materials = Material.all.paginate(page: params[:page], per_page: 30)

SELECT  `materials`.* FROM `materials`  WHERE `materials`.`id` = 1 LIMIT 1
---
  def edit
    @material = Material.find(params[:id])

SELECT  `materials`.* FROM `materials`  WHERE `materials`.`id` = 4 LIMIT 1
UPDATE `materials` SET `name` = 'newMaterialName', `updated_at` = '2014-07-09 21:40:43' WHERE `materials`.`id` = 4
---
  def update
    @material = Material.find(params[:id])
    if @material.update_attributes(material_params)

SELECT  `materials`.* FROM `materials`  WHERE `materials`.`id` = 5 LIMIT 1
DELETE FROM `materials` WHERE `materials`.`id` = 5
---
  def destroy
    @material = Material.find(params[:id])
    @material.destroy