app/controllers/admin/materials_controller.rb

SELECT  "materials".* FROM "materials"  LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "materials"
---
  def index
    @materials = Material.all.paginate(page: params[:page], per_page: 30)