app/controllers/admin/orders_controller.rb

  def update
    @order = Order.find(params[:id])
    if @order.update_attributes(order_params)
---
SELECT  `orders`.* FROM `orders`  WHERE `orders`.`id` = 5 LIMIT 1
UPDATE `orders` SET `status` = 'Shipped', `tracking_number` = '123123123', `updated_at` = '2014-07-09 21:40:50' WHERE `orders`.`id` = 5

  def export
    from_date = params[:from_date].blank? ? Date.strptime("01/01/2014", '%m/%d/%Y') : Date.strptime(params[:from_date], '%m/%d/%Y')
    to_date = params[:to_date].blank? ? Date.today : Date.strptime(params[:to_date], '%m/%d/%Y')
    data = CsvGenerator.orders_report(from_date, to_date)
---
SELECT `orders`.* FROM `orders`  WHERE (DATE(order_date) >= '2014-07-08' and DATE(order_date) <= '2014-07-10' and status in ('In progress','Shipped'))  ORDER BY order_date ASC