app/controllers/admin/products_controller.rb

SELECT  `products`.* FROM `products`   ORDER BY name ASC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `products`
---
  def index
    @products = Product.all.paginate(page: params[:page], per_page: 30)

SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 10  ORDER BY name ASC LIMIT 1
---
  def edit
    @product = Product.find(params[:id])

SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 2  ORDER BY name ASC LIMIT 1
UPDATE `products` SET `taxable` = 0, `updated_at` = '2014-07-09 21:41:34' WHERE `products`.`id` = 2
---
  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(product_params)

INSERT INTO `products` (`category_id`, `created_at`, `long_description`, `material_id`, `meta_description`, `name`, `page_title`, `shape_id`, `short_description`, `taxable`, `updated_at`, `vendor_id`) VALUES (2, '2014-07-09 21:41:05', 'Something', 7, 'My Meta Description', 'Lorem', 'My Page Title', 2, 'Ipsum', 1, '2014-07-09 21:41:05', 2)
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 1  ORDER BY name ASC LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 1
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy