app/controllers/admin/products_controller.rb

SELECT  "products".* FROM "products"   ORDER BY name ASC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "products"
---
  def index
    @products = Product.all.paginate(page: params[:page], per_page: 30)