app/controllers/admin/product_images_controller.rb

  def destroy
    @product_image = ProductImage.find(params[:id])
    @product_image.destroy
---
SELECT  `product_images`.* FROM `product_images`  WHERE `product_images`.`id` = 5 LIMIT 1
DELETE FROM `product_images` WHERE `product_images`.`id` = 5