app/controllers/admin/returns_controller.rb

SELECT  `returns`.* FROM `returns`  LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `returns`
---
  def index
    @search_terms = params[:q]
    @search = Return.search(@search_terms)
    @returns = @search.result.paginate(page: params[:page], per_page: 30)

SELECT  `returns`.* FROM `returns`  WHERE `returns`.`id` = 4 LIMIT 1
---
  def show
    @return = Return.find(params[:id])

SELECT  `returns`.* FROM `returns`  WHERE `returns`.`id` = 6 LIMIT 1
UPDATE `returns` SET `admin_comment` = 'Only half price was returned', `amount_cents` = 1122, `status` = 'Received', `updated_at` = '2014-07-09 21:42:00' WHERE `returns`.`id` = 6
---
  def update
    @return = Return.find(params[:id])
    if @return.update_attributes(return_params)