app/controllers/admin/variants_controller.rb

SELECT  `variants`.* FROM `variants`  WHERE `variants`.`id` = 3 LIMIT 1
DELETE FROM `variants` WHERE `variants`.`id` = 3
---
  def remove
    if params[:id].present?
      variant = Variant.find(params[:id])
      variant.destroy