app/controllers/admin/vendors_controller.rb

  def create
    @vendor = Vendor.where(name: vendor_params[:name]).first_or_create
---
INSERT INTO `vendors` (`created_at`, `name`, `updated_at`) VALUES ('2014-07-09 21:41:12', 'Gucci', '2014-07-09 21:41:12')
SELECT  `vendors`.* FROM `vendors`  WHERE `vendors`.`name` = 'Gucci'  ORDER BY `vendors`.`name` ASC LIMIT 1

  def index
    @vendors = Vendor.all.paginate(page: params[:page], per_page: 30)
---
SELECT COUNT(*) FROM `vendors`

  def update
    @vendor = Vendor.find(params[:id])
    if @vendor.update_attributes(vendor_params)
---
UPDATE `vendors` SET `name` = 'newVendorName', `updated_at` = '2014-07-09 21:42:04' WHERE `vendors`.`id` = 4

  def destroy
    @vendor = Vendor.find(params[:id])
    @vendor.destroy
---
DELETE FROM `vendors` WHERE `vendors`.`id` = 5