app/views/admin/orders/show.html.erb

SELECT `line_items`.* FROM `line_items`  WHERE `line_items`.`order_id` = 4
---
<h3>Line Items</h3>
<% @order.line_items.each do |line_item| %>

SELECT  `sizes`.* FROM `sizes`  WHERE `sizes`.`id` = 6  ORDER BY sort_order ASC LIMIT 1
SELECT  `variants`.* FROM `variants`  WHERE `variants`.`id` = 6 LIMIT 1
---
  <div>Color: <%= line_item.variant.products_color.color.name %></div>
  <div>Size: <%= line_item.variant.size.name %></div>

SELECT  `addresses`.* FROM `addresses`  WHERE `addresses`.`type` IN ('ShippingAddress') AND `addresses`.`order_id` = 4 LIMIT 1
---
<h3>Shipping Address</h3>
<div>First Name: <%= @order.shipping_address.first_name %></div>