app/views/admin/returns/show.html.erb

SELECT  `orders`.* FROM `orders`  WHERE `orders`.`id` = 4 LIMIT 1
---

<% order = @return.order %>

SELECT `return_items`.* FROM `return_items`  WHERE `return_items`.`return_id` = 4
---
<h3>Items</h3>
<% @return.return_items.each do |return_item| %>

SELECT  `sizes`.* FROM `sizes`  WHERE `sizes`.`id` = 10  ORDER BY sort_order ASC LIMIT 1
SELECT  `variants`.* FROM `variants`  WHERE `variants`.`id` = 10 LIMIT 1
---
  <div>Color: <%= line_item.variant.products_color.color.name %></div>
  <div>Size: <%= line_item.variant.size.name %></div>