app/views/orders/show.html.erb

<h3>Line Items</h3>
<% @order.line_items.each do |line_item| %>
---
SELECT `line_items`.* FROM `line_items`  WHERE `line_items`.`order_id` = 10

  <div>Color: <%= line_item.variant.products_color.color.name %></div>
  <div>Size: <%= line_item.variant.size.name %></div>
---
SELECT  `sizes`.* FROM `sizes`  WHERE `sizes`.`id` = 22  ORDER BY sort_order ASC LIMIT 1
SELECT  `variants`.* FROM `variants`  WHERE `variants`.`id` = 22 LIMIT 1

<h3>Shipping Address</h3>
<div>First Name: <%= @order.shipping_address.first_name %></div>
---
SELECT  `addresses`.* FROM `addresses`  WHERE `addresses`.`type` IN ('ShippingAddress') AND `addresses`.`order_id` = 10 LIMIT 1