app/views/returns/new.html.erb

SELECT  `colors`.* FROM `colors` INNER JOIN `products_colors` ON `colors`.`id` = `products_colors`.`color_id` WHERE `products_colors`.`id` = 26  ORDER BY name ASC LIMIT 1
SELECT  `products`.* FROM `products` INNER JOIN `products_colors` ON `products`.`id` = `products_colors`.`product_id` WHERE `products_colors`.`id` = 26  ORDER BY name ASC LIMIT 1
SELECT  `sizes`.* FROM `sizes`  WHERE `sizes`.`id` = 26  ORDER BY sort_order ASC LIMIT 1
SELECT  `variants`.* FROM `variants`  WHERE `variants`.`id` = 26 LIMIT 1
---
        <%= ri.check_box :chosen %>
        <%= "#{ri.object.line_item.variant.product.name} - #{ri.object.line_item.variant.color.name} - #{ri.object.line_item.variant.size.name}" %>