app/views/returns/show.html.erb

SELECT  `orders`.* FROM `orders`  WHERE `orders`.`id` = 12 LIMIT 1
---

<%= link_to "View Return Slip", order_return_path(@return.order, @return, format: :pdf) %>

SELECT `return_items`.* FROM `return_items`  WHERE `return_items`.`return_id` = 9
---
<h3>Items:</h3>
<% @return.return_items.each do |return_item| %>

SELECT  `sizes`.* FROM `sizes`  WHERE `sizes`.`id` = 26  ORDER BY sort_order ASC LIMIT 1
SELECT  `variants`.* FROM `variants`  WHERE `variants`.`id` = 26 LIMIT 1
---
  <%= return_item.line_item.variant.product.name %> -  <%= return_item.line_item.variant.color.name %> -
  <%= return_item.line_item.variant.size.name %>