app/views/checkouts/billing.html.erb

	<%= f.label :shipping_address_state_id, "State" %>
	<%= f.collection_select :shipping_address_state_id, State.all, :id, :short_name %>
---
SELECT `states`.* FROM `states`

<%#= hidden_field_tag "credit_card[order_id]", @payment_info.order.id, id: "payment_info_order_id" %>
<% current_or_guest_user.cart.cart_items.each do |cart_item| %>
---
SELECT  `carts`.* FROM `carts`  WHERE `carts`.`user_id` = 151 LIMIT 1
SELECT `cart_items`.* FROM `cart_items`  WHERE `cart_items`.`cart_id` = 189

		Product Name: <%= cart_item.variant.product.name %>
		Size: <%= cart_item.variant.size.name %>
---
SELECT  `sizes`.* FROM `sizes`  WHERE `sizes`.`id` = 150  ORDER BY sort_order ASC LIMIT 1
SELECT  `variants`.* FROM `variants`  WHERE `variants`.`id` = 147 LIMIT 1