app/views/checkouts/update_billing.js.erb

SELECT  `orders`.* FROM `orders`  WHERE `orders`.`id` = 1 LIMIT 1
---
	$(".order_info :input").attr("disabled", false);
	$(".order_fees_div").html("<%=j render partial: 'order_fees', locals: {order: @payment_info.order} %>");