app/views/admin/collections/edit.html.erb

  Available Products:<br>
  <%= select_tag :unassociated_product_ids, options_for_select((Product.all - @collection.products).map { |p| [p.name, p.id] }), {multiple: true, class: "product_multiselect"} %>
---
SELECT `products`.* FROM `products` INNER JOIN `collections_products` ON `products`.`id` = `collections_products`.`product_id` WHERE `collections_products`.`collection_id` = 1  ORDER BY name ASC, products.name