app/views/admin/products/_products_color.html.erb

SELECT `colors`.* FROM `colors`   ORDER BY name ASC
---
      <div class="colors_container">
        <%= pc.select :color_id, color_options_with_extra_link_to_create_color, {}, {class: "colors"} %>

SELECT `product_images`.* FROM `product_images`  WHERE `product_images`.`products_color_id` = 15  ORDER BY sort_order ASC
---
  <ul class="sorted_product_image_list">
    <% pc.object.product_images.each do |product_image| %>

SELECT `sizes`.* FROM `sizes`   ORDER BY sort_order ASC
SELECT  `sizes`.* FROM `sizes`  WHERE `sizes`.`id` = 15  ORDER BY sort_order ASC LIMIT 1
---
      <% if v.object.new_record? %>
        <%= v.collection_select :size_id, Size.all, :id, :name, {}, {class: "size_select"} %>
      <% else %>
        <%= v.object.size.name %>