app/views/admin/products/_size.html.erb

  <%= label_tag "Size" %>
  <%= select_tag :size, options_from_collection_for_select(Size.all, :id, :name), id: nil, class: "sizes" %>
---
SELECT `sizes`.* FROM `sizes`   ORDER BY sort_order ASC