app/views/admin/products/_variant_combinations.html.erb

SELECT `sizes`.* FROM `sizes`   ORDER BY sort_order ASC
---
          <td>
            <%= select_tag "product[products_colors_attributes][#{pc_index}][variants_attributes][#{v_index}][size_id]", options_from_collection_for_select(Size.all, :id, :name, variant.size_id) %>