app/controllers/cart_items_controller.rb

  def destroy
    @cart_item = CartItem.find(params[:id])
    @cart_item.destroy
---
SELECT  `cart_items`.* FROM `cart_items`  WHERE `cart_items`.`id` = 39 LIMIT 1
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 39