app/controllers/checkouts_controller.rb

SELECT  `coupons`.* FROM `coupons`  WHERE (DATE(start_date) <= '2014-07-09' AND DATE(end_date) >= '2014-07-09') AND `coupons`.`site_wide` = 1  ORDER BY `coupons`.`id` DESC LIMIT 1
SELECT  `addresses`.* FROM `addresses`  WHERE `addresses`.`type` IN ('ShippingAddress') AND `addresses`.`order_id` = 1 LIMIT 1
---
  def billing
    @order = current_or_guest_user.last_incomplete_order
    @site_wide_coupon = Coupon.active.site_wide.last


    if current_user


      shipping_address = nil
      billing_address = nil
      if current_user.past_orders.present? && !@order.shipping_address && !@order.billing_address

UPDATE `users` SET `current_sign_in_at` = '2014-07-09 21:25:52', `current_sign_in_ip` = '127.0.0.1', `last_sign_in_at` = '2014-07-09 21:25:52', `last_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2014-07-09 21:25:52' WHERE `users`.`id` = 151
---
  def signup_user
    if current_or_guest_user.update_attributes(guest_user_params)

SELECT  `users`.* FROM `users`  WHERE `users`.`email` = '' LIMIT 1
---
  def login_user
    @user = User.find_by_email(params[:user][:email])