app/controllers/collections_controller.rb

  def show
    @collection = Collection.find(params[:id])
---
SELECT  `collections`.* FROM `collections`  WHERE `collections`.`id` = 1  ORDER BY name ASC LIMIT 1