app/controllers/products_controller.rb

  def index
    @products = Product.where(active: true)
---
SELECT `products`.* FROM `products`  WHERE `products`.`active` = 1  ORDER BY name ASC