app/controllers/products_controller.rb

  def show
    @product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 54  ORDER BY name ASC LIMIT 1