app/controllers/returns_controller.rb

SELECT  `line_items`.* FROM `line_items`  WHERE `line_items`.`order_id` = 12  ORDER BY `line_items`.`id` DESC LIMIT 1
SELECT  `orders`.* FROM `orders`  WHERE `orders`.`id` = 12 LIMIT 1
---
  def new
    @return = Return.new(order_id: params[:order_id], user_id: current_user.id)
    @return.order.line_items.each do |line_item|

INSERT INTO `returns` (`created_at`, `order_id`, `reason`, `rma_code`, `status`, `updated_at`, `user_id`) VALUES ('2014-07-09 21:42:14', 12, 'Item is damaged', '5b16e3b1de', 'Processing', '2014-07-09 21:42:14', 26)
SELECT  `orders`.* FROM `orders`  WHERE `orders`.`id` = 12 LIMIT 1
---
  def create
    @return = Return.new(return_params)
    @return.generate_rma_code
    if @return.save
      redirect_to order_return_path(@return.order, @return), notice: "Your return was successfully submitted."

SELECT  `returns`.* FROM `returns`  WHERE `returns`.`order_id` = 12 AND `returns`.`id` = 9 LIMIT 1
---
  def show
    @return = Return.find_by(order_id: params[:order_id], id: params[:id])