app/views/products/show.html.erb

SELECT `products_colors`.* FROM `products_colors`  WHERE `products_colors`.`product_id` = 54
---

<% @product.products_colors.each do |pc| %>

SELECT  `sizes`.* FROM `sizes`  WHERE `sizes`.`id` = 144  ORDER BY sort_order ASC LIMIT 1
---
      <%= form_tag add_to_cart_checkout_path, method: :post do %>
        <%= variant.size.name %>